[
  {
    "title": "Every Brilliant Thing",
    "presenter": "Paines Plough and Second Half Productions ",
    "location": "ROUNDABOUT @ Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EVERYBR_CFO_1.jpg",
    "description": "Ten years on from the play’s debut, a new production of the smash-hit comes to Roundabout, directed by Duncan Macmillan and performed by Jonny Donahoe. You’re seven years old. Mum’s in hospital. Dad says she’s ‘done something stupid'. She finds it hard to be happy. So you make a list of everything that’s brilliant about the world. Everything worth living for. Ice cream. Water fights. Staying up past your bedtime and being allowed to watch TV. The colour yellow. Rollercoasters. People falling over. A play about depression and the lengths we go to for those we love.; Category: Theatre",
    "start": ""
  },
  {
    "title": "Nation",
    "presenter": "YESYESNONO",
    "location": "ROUNDABOUT @ Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NATION_CFO.jpg",
    "description": "'Here we all are... sat together in one room. One room. One audience. One… beautiful nation'. From the creator of We Were Promised Honey! and Five Encounters on a Site Called Craigslist comes a new experiment in storytelling. It’s the story of a nation. It’s the story of a theatre. It’s the story of an audience. Outside there are people trying to get in. And in the middle of the room… apparently a show is taking place. ‘YESYESNONO make shows that feel completely different to anybody else’ (Exeunt). Off West End Award finalist, 2022. Best Production, Total Theatre Award.; Category: Theatre",
    "start": "Aug 8-12, 14-19, 21-26 "
  },
  {
    "title": "Best of Edinburgh Showcase Show 2024",
    "presenter": "Joss Jones for EdCom Productions",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BESTOFE_PD.jpg",
    "description": "Great value lunchtime comedy showcase featuring the best and brightest of this year's Fringe comics. Hand-picked and with changing line-ups daily – take a seat, you're in for a treat! Now in its 19th successful year in the Cabaret Bar, this is the best way to start the day for comedians and festival comedy fans alike. See edcomproductions.com for daily listings and news. 'A perfect bite-sized flavour of the festival [...] A brilliant way to discover new talent' **** (ThreeWeeks). 'This delightful afternoon slot at The Pleasance is a crowd pleaser' (BroadwayBaby.com).; Category: Comedy",
    "start": "Aug 7-14, 16-25 "
  },
  {
    "title": "Rebels and Patriots",
    "presenter": "Floating Shed",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024REBELSA_PH.jpg",
    "description": "Hath not a Jew eyes? Hath not an Arab eyes? Israeli-Palestinian co-creation following four friends and how mandatory conscription to the IDF affects them. One wants to get out, one's a pilot, one was never drafted, one's torn inside. A raw multilingual, physical portrayal that exposes the consequences army life has on the mental-health of the teenagers enlisted. It explores themes like protest against war, self-harm and what it means to be Israeli and peace-pursuing; the critical voice for coexistence under the pressures of politically motivated violence. Who's a rebel? Who's a patriot?; Category: Theatre",
    "start": "Aug 6, 8-13, 15-20, 22-26 "
  },
  {
    "title": "Paddy Young: If I Told You I'd Have to Kiss You",
    "presenter": "Berk's Nest in association with PARKAS Comedy",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PADDYYO_BRR.jpg",
    "description": "A second show has hit Paddy Young, and this time he's yearning. You ever been so loved up you've had to hit yourself over the head with a hammer to calm down? You can't stare at your crush but my god you can close your eyes and imagine your future together. Thousands of kisses, hundreds of cuddles and the tiniest bit of shagging - Paddy xxx. 'Young is surely on the road to stardom' ***** (Rolling Stone). **** (Independent). **** (Scotsman). **** (ThreeWeeks). **** (Chortle.co.uk). **** (Entertainment-Now.com). **** (BeyondTheJoke.co.uk).; Category: Comedy",
    "start": "Aug 6-13, 15-23 "
  },
  {
    "title": "The Big Bite-Size Breakfast Show",
    "presenter": "Pleasance and White Room",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BIGBITE_PN.jpg",
    "description": "Good morning Edinburgh! We're back bringing you brand-new, delicious, rotating \"menus\" of 10-15 minute comedies, eccentricities and mini-dramas - all served up with complimentary tea and coffee, croissants and strawberries. The perfect way to start your day! 'One of the most important shows you'll see at the Fringe' ***** (Daily Record). ***** (FringeReview.co.uk – Brighton, Edinburgh and Adelaide). ***** (WhatsOnStage.com). Carol Tambor Award – Shortlist. Sky Arts Broadcasts. ThreeWeeks Editors' Nomination. Observer / Guardian Picks of the Fringe. Full 'menu' information available at: https://www.bite-size.org.uk/; Category: Theatre",
    "start": "Aug 7-13, 15-22, 24-26 "
  },
  {
    "title": "The Long Run",
    "presenter": "Grace Dickson Productions and New Diorama Theatre",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LONGRUN_P8.jpg",
    "description": "A joyful, captivating comedy about love, cancer and running for a really long time. When Katie's mum is diagnosed with cancer, her life grinds to a stop. But when she meets an elderly man in the radiotherapy waiting room corridor - everything changes. Created by multi award-winning writer-performer Katie Arnstein (Sexy Lamp, Sticky Door, Wolverine Woman) and directed by New Diorama's Artistic Director Bec Martin, The Long Run is a tender, emotionally rich - and frequently hilarious - story about human connection, cancer diagnosis and long-distance running. Nominated for an Offie for Best Performance Piece 2023.; Category: Theatre",
    "start": "Aug 6, 8-11, 13-18, 20-25 "
  },
  {
    "title": "Luke Wright: Joy!",
    "presenter": "Luke Wright",
    "location": "Pleasance Dome",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LUKEWRI_PT.jpg",
    "description": "Novelist Henry de Montherlant said that 'happiness writes white' but Wright's not exactly starting with a blank page. The Fringe's favourite poet returns with stacks of brilliant, big-hearted poems that get to grips with joy in mulchy middle age. Come let a little joy into your life with a raconteur and wordsmith at the top of his game. ***** (Telegraph). 'Breathtaking... sharpness and wisdom that lifts the soul, and soothes the battered heart' **** (Scotsman). 'A winning combination of honesty, humour, ire and wonder. He is at the peak of his powers' ***** (Stage).; Category: Theatre",
    "start": "Aug 6-13 "
  },
  {
    "title": "Sh!t Theatre: Or What's Left of Us",
    "presenter": "Sh!t Theatre and Soho Theatre",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ORWHATS_AKS.jpg",
    "description": "Multi award-winning 'magnificent Fringe legends' (Time Out) Sh!t Theatre are back! And we're totally fine! Actually all things considered, we're OK. Feeling alright. Thriving, even? That's a bit far, but we have learnt some folk songs. We've got into folk recently and it's been really helpful. Come sing some folk songs with us! A swift 60 minutes of classic folk followed by a singaround in the Summerhall bar. Because we need a drink, don't we? But we're doing OK. 'Few companies make shows that are so consistently, outrageously fun*' (Guardian). *fun not guaranteed; Category: Theatre",
    "start": "Aug 13-16, 18, 20-25 "
  },
  {
    "title": "Jo Caulfield Pearls Before Swine",
    "presenter": "Jo Caulfield / The Stand Comedy Club",
    "location": "The Stand Comedy Club 3 & 4",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JOCAULF_SV.jpg",
    "description": "Jo's best jokes and funniest routines from her 2024 tour show. Voted Comedian's Comedian of the Year. Relish razor-sharp observations and scandalous one-liners as Jo gets her claws into everything that annoys her. Featured on HIGNFY, House Of Games, Mock The Week, Michael McIntyre Show, John Bishop Show, Breaking The News. 'Packed with brilliant lines, embarrassing anecdotes and hilarious insights' ***** (Herald). 'Sharp-witted urban comedy that goes down a treat' ***** (Times). 'One of Britain's smartest comics' ***** (Scotsman). 'There is a reason her shows are constantly selling out, she is fantastic' ***** (ThreeWeeks).; Category: Comedy",
    "start": "Aug 7-11, 13-18, 20-25 "
  },
  {
    "title": "Jo Caulfield Pearls Before Swine",
    "presenter": "Jo Caulfield / The Stand Comedy Club",
    "location": "The Stand Comedy Club 3 & 4",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JOCAULF_SV.jpg",
    "description": "Jo's best jokes and funniest routines from her 2024 tour show. Voted Comedian's Comedian of the Year. Relish razor-sharp observations and scandalous one-liners as Jo gets her claws into everything that annoys her. Featured on HIGNFY, House Of Games, Mock The Week, Michael McIntyre Show, John Bishop Show, Breaking The News. 'Packed with brilliant lines, embarrassing anecdotes and hilarious insights' ***** (Herald). 'Sharp-witted urban comedy that goes down a treat' ***** (Times). 'One of Britain's smartest comics' ***** (Scotsman). 'There is a reason her shows are constantly selling out, she is fantastic' ***** (ThreeWeeks).; Category: Comedy",
    "start": "Aug 7-11, 13-18, 20-25 "
  },
  {
    "title": "Lynn Faces",
    "presenter": "Co-commissioned by New Diorama Theatre, Norwich Theatre, Theatre Royal Plymouth",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LYNNFAC_6C.jpg",
    "description": "Nearing 40, painfully shy, and emerging from a toxic break-up, Leah forms a punk bank inspired by Lynn from Alan Partridge. As she takes to the stage with no musical ability, will this gig push Leah further over the edge, or help her regain her confidence and find the hope she needs to move on? A funny, farcical and poignant new play, exploring the impact of abusive behaviour, the power of friendship and how silliness can be healing. Lynn Faces is a new play by multi award-winning writer Laura Horton, following her Fringe First-winning show, Breathless.; Category: Theatre",
    "start": "Aug 6-11, 13-18, 20-26 "
  },
  {
    "title": "Catherine Bohart: Again, With Feelings",
    "presenter": "Soho Theatre",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CATHERJ_BRQ.jpg",
    "description": "Catherine Bohart's back and ready to talk about her feelings (again). Join one of UK & Ireland's most exciting comics for a hilariously twisted second coming of age saga as she reckons with death obsessed parents, queer reproduction and how adulthood, frankly, isn't living up to her expectations. Host of hit podcast Trusty Hogs. As seen and heard on Live at the Apollo, The Mash Report, Immaculate (Amazon Prime Special), Mock the Week and The News Quiz. 'Firecracker of an hour… her best yet' ***** (Guardian). ‘She keeps the laughs coming' **** (Times).; Category: Comedy",
    "start": "Aug 12-16, 20-23, 25 "
  },
  {
    "title": "Burning Down the Horse",
    "presenter": "Fishing4Chips",
    "location": "Pleasance Dome",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BURNING_PQ.jpg",
    "description": "After a five-star sell-out run in 2023, Burning Down the Horse is back! This immersive comedy epic drops you into the heart of the most iconic wooden animal in history – the Trojan Horse. Become part of this 'infectiously funny' (FringeReview.co.uk) tale as you contend with heroic egos, class clashes and sword supply issues. There's only one rule: Odysseus' word is law. And for the love of gods – no naked flames! Join us for an 'entertaining slice of lunchtime laughs' (Scotsman) and experience what really went on inside the belly of the beast.; Category: Theatre",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "I'm Almost There",
    "presenter": "Audible, Francesca Moody Productions and DryWrite",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024IMALMOS_6C.jpg",
    "description": "Love at first sight is easy, letting it through the front door is a goddamn Odyssey. All he wants to do is let the perfect man in, but can he overcome his unhinged neighbour, a\nseductive cult, a self-obsessed vampire, and a cat intent on dragging him to hell? From Audible and the award-winning producers of Fleabag and Baby Reindeer, I'm Almost There is New York favourite Todd Almond's rueful, hilarious and poignant modern love story in song about a man crossing a sea of doubts to find happiness…and good coffee.; Category: Theatre",
    "start": "Aug 7-11, 14-18, 20-26 "
  },
  {
    "title": "I'm Almost There",
    "presenter": "Audible, Francesca Moody Productions and DryWrite",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024IMALMOS_6C.jpg",
    "description": "Love at first sight is easy, letting it through the front door is a goddamn Odyssey. All he wants to do is let the perfect man in, but can he overcome his unhinged neighbour, a\nseductive cult, a self-obsessed vampire, and a cat intent on dragging him to hell? From Audible and the award-winning producers of Fleabag and Baby Reindeer, I'm Almost There is New York favourite Todd Almond's rueful, hilarious and poignant modern love story in song about a man crossing a sea of doubts to find happiness…and good coffee.; Category: Theatre",
    "start": "Aug 7-11, 14-18, 20-26 "
  },
  {
    "title": "12th Year! John Hunt Four O'Clock Afternoon Blues and Swing",
    "presenter": "21st Century Blues Legends",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412THYEA_ZO.jpg",
    "description": "'Fantastic!' (Jools Holland). 'Boogie-woogie slide-guitar master' **** (Scotsman). 'The Fringe's most unique, inventive and soulful blues performer, a fantastic gig' **** (BroadwayBaby.com). Hunt's 12th Fringe following 11 years of full-house performances. 'Blues legend built his own cannibalised, recycled guitars from a B&Q shelf and papier-mache' **** (Herald). 'Instantly evocative of the deep south blues. Unique R'n'B take on Sinatra alongside a James Bond mash-up. Whatever Hunt plays, it feels refreshingly authentic' **** (List). 'Ingenious 21st-century blues' **** (ThreeWeeks). 'Like Seasick Steve in a science lab, a storming set' (Ian Rankin).; Category: Music",
    "start": "Aug 7, 9-10, 14, 16-18, 22, 24 "
  },
  {
    "title": "12th Year! John Hunt Four O'Clock Afternoon Blues and Swing",
    "presenter": "21st Century Blues Legends",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412THYEA_ZO.jpg",
    "description": "'Fantastic!' (Jools Holland). 'Boogie-woogie slide-guitar master' **** (Scotsman). 'The Fringe's most unique, inventive and soulful blues performer, a fantastic gig' **** (BroadwayBaby.com). Hunt's 12th Fringe following 11 years of full-house performances. 'Blues legend built his own cannibalised, recycled guitars from a B&Q shelf and papier-mache' **** (Herald). 'Instantly evocative of the deep south blues. Unique R'n'B take on Sinatra alongside a James Bond mash-up. Whatever Hunt plays, it feels refreshingly authentic' **** (List). 'Ingenious 21st-century blues' **** (ThreeWeeks). 'Like Seasick Steve in a science lab, a storming set' (Ian Rankin).; Category: Music",
    "start": "Aug 7, 9-10, 14, 16-18, 22, 24 "
  },
  {
    "title": "A History of Jazz in Four Saxophones",
    "presenter": "Mark McKergow ",
    "location": "Scottish Arts Club",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024HISTORC_CBO.jpg",
    "description": "This unique show sees Mark McKergow talking about and performing music of the sax giants on the same model vintage saxophones they played! Discover the music made famous by Sidney Bechet, Johnny Hodges, John Coltrane, Gerry Mulligan and more. Join Mark and a specially assembled young band for this insightful and entertaining concert. One of the most versatile jazz saxophonists in Scotland. He’s played everything from New Orleans, swing, bop, big band to free improvisation, writes for London Jazz News and currently performs with Sound Of Seventeen Big Band and Shunpike Social Club.; Category: Music",
    "start": ""
  },
  {
    "title": "Rose Matafeo: On and On and On",
    "presenter": "Avalon",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ROSEMAT_PO.jpg",
    "description": "Do you ever feel like you're meeting yourself again and again in a bad way? Winner of the 2018 Edinburgh Comedy Award and creator of Starstruck, Rose Matafeo returns to the Fringe in a bigger room than last year.; Category: Comedy",
    "start": ""
  },
  {
    "title": "Bill's 44th",
    "presenter": "Dorothy James and Andy Manjuck in association with Underbelly",
    "location": "Underbelly, Cowgate",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BILLS44_UA.jpg",
    "description": "The tragi-comedy hit Bill's 44th makes a triumphant return to the Edinburgh Fringe, performed by critically acclaimed puppeteering duo Andy Manjuck and Dorothy James. 'Buoyant, mesmerizing, joy-inducing' (New York Times). This 'tender and boozy puppet party' – **** (Guardian) – is a wordless spectacle featuring puppets, raucous balloons, and a cheeky piece of crudité that collide to examine the pitfalls of impatience, the wonder of loneliness, and the universal passage of time. A 'surreal tragicomedy, enormously funny and at times delightfully unsettling' **** (Everything-Theatre.co.uk). 'Sweetly hilarious with flashes of bizarre originality' **** (TheReviewsHub.com).; Category: Theatre",
    "start": "Aug 7-11, 13-25 "
  },
  {
    "title": "Ahir Shah: Ends",
    "presenter": "Ahir Shah",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AHIRSHB_PA.jpg",
    "description": "Ahir Shah brings his 2023 Sky Edinburgh Comedy Award-winning show Ends back to the Fringe for 12 shows only. It's about family, immigration, marriage, history, politics and beans. 'An astonishing comedy hour... Takes audiences to the highest of highs of human emotion' ***** (Independent). 'Poignant, powerful, extremely funny... Truly outstanding stand-up' ***** (Evening Standard). ***** (Guardian). ***** (Chortle.co.uk). ***** (Mail on Sunday).; Category: Comedy",
    "start": "Aug 13-15, 18-23 "
  },
  {
    "title": "Natalie Palamides: WEER",
    "presenter": "Soho Theatre",
    "location": "Traverse Theatre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TESX_N5.jpg",
    "description": "New Year’s Eve 1999. Star-crossed lovers. A quarrel at the strike of midnight. Edinburgh Comedy Award Winner Natalie Palamides (Nate, Netflix) presents an achingly tender 90s rom-drom (romantic dramedy) which asks you to look at every argument from two sides. 'Outrageous and electrifying comedy' ***** (Guardian). 'I sat open-mouthed with surprise and excitement through most of this 21st-century clowning, laughed often and found myself moved to tears at the end… Stunning' ***** (Times). 'Hilarious and unsettling... an undoubted triumph.' ***** (Skinny). 'Palamides is probably the world's most talented and boundary-pushing purveyor of this type of comedy' (Telegraph).; Category: Comedy",
    "start": "Aug 7-11, 15-16, 18, 21-25 "
  },
  {
    "title": "The Sound Inside",
    "presenter": "Cusack Projects Ltd, Half Moon Street Ltd, Traverse Theatre Company",
    "location": "Traverse Theatre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SOUNDIN_N5.jpg",
    "description": "UK premiere. Nominated for six Tony Awards including Best Play. Cast: Madeleine Potter and Eric Sirakian. Director: Matt Wilkinson. A solitary Ivy League creative writing professor is captivated by a brilliant, rebellious freshman student. Delicate, provocative, bursting with wit – so begins the story of two outsiders on the threshold of breaking of an indelible taboo. And when the darkest of favours is requested, the stage is set: The Sound Inside drives inexorably towards a climax filled with mystery, beauty and the ultimate declaration of love. 'A gripping small-scale mystery… subliminal, sublime.' (New York Times).; Category: Theatre",
    "start": "Aug 7-11, 13-14, 16, 18, 21-25 "
  },
  {
    "title": "Duck",
    "presenter": "Two Magpies Productions and Pleasance",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DUCK_P8.jpg",
    "description": "It’s the summer of 2005, England prepares to win the Ashes and Ismail (Smiley to his friends), a British Indian schoolboy, is about to become the youngest ever player in his elite public school’s First XI cricket team. He sets his sights on immortality, breaking the school batting record and getting his name into Wisden. But things are about to heat up. From award-winning playwright maatin, Duck is about adolescence, the pressures of sporting competition and finding your identity in an environment that doesn’t cater for difference. Recipient of the Pleasance's Charlie Hartill Fund 2024.; Category: Theatre",
    "start": "Aug 6-11, 13-18, 20-26 "
  },
  {
    "title": "Aaaah Look Who It Is: Jed Potts and Nicole Smit, Again!",
    "presenter": "Jed Potts and Nicole Cassandra Smit",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAAAHLO_ZO.jpg",
    "description": "The King and Queen of Scottish blues are back with their tongue-in-cheek take on jazz, country and dreamy soundscapes. Jed and Nicole's banter will make you laugh and the songs will bring some tears, guaranteed. For fans of Patsy Cline, George Jones, Nina Simone and Patti Page.; Category: Music",
    "start": "Aug 13, 15 "
  },
  {
    "title": "Pear",
    "presenter": "Indigo Productions",
    "location": "Underbelly, Cowgate",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PEAR_N6.jpg",
    "description": "Winner of the Critics' Choice Award, Fringe World 2023. 'There is something seriously special about this pairing... A riotously fun night out.' ***** (MumbleComedy.net). Six foot seven identical twins Patrick and Hugo McPherson present a new hour of chaotic sketch comedy. Pear is the unique, award-winning sketch show described as 'hilarious from start to finish' ***** (MervsPOTFringe.com) and 'relentlessly packed with jokes' ***** (ThreeWeeks). Come witness the tallest, most identical comedians at the Fringe (not proven, though confidently assumed). 'Book a ticket to this show immediately!' ***** (Fringefeed.com.au).; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Colin Steele Quintet Play Miles Davis",
    "presenter": "Colin Steele",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024COLINST_ZO.jpg",
    "description": "An avid fan of Miles Davis, trumpeter Colin Steele is the master when it comes to paying homage to musical legends. The quintessential 50s New York jazz club experience, selling out every night last year, and named as Ian Rankin’s live gig of the year 2023. Timeless classics played with freshness and passion. 'The most utterly sublime jazz I’ve heard in a long time... A scintillating, pulsating ninety minutes of superlative playing from one of Scotland’s finest jazz ensembles' (FringeReview.co.uk). Featuring Konrad Wiszniewski (saxophone), Dave Milligan (piano), Kenny Ellis (bass) and Max Popp (drums).; Category: Music",
    "start": "Aug 14-18 "
  },
  {
    "title": "Colin Steele Quintet Play Miles Davis",
    "presenter": "Colin Steele",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024COLINST_ZO.jpg",
    "description": "An avid fan of Miles Davis, trumpeter Colin Steele is the master when it comes to paying homage to musical legends. The quintessential 50s New York jazz club experience, selling out every night last year, and named as Ian Rankin’s live gig of the year 2023. Timeless classics played with freshness and passion. 'The most utterly sublime jazz I’ve heard in a long time... A scintillating, pulsating ninety minutes of superlative playing from one of Scotland’s finest jazz ensembles' (FringeReview.co.uk). Featuring Konrad Wiszniewski (saxophone), Dave Milligan (piano), Kenny Ellis (bass) and Max Popp (drums).; Category: Music",
    "start": "Aug 14-18 "
  },
  {
    "title": "Ania Magliano: Forgive Me, Father",
    "presenter": "Country Mile Productions in association with Avalon Management",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ANIAMAG_PC.jpg",
    "description": "You know when you're trying to wee on a night out, and you're interrupted by a random girl who insists on telling you all her secrets even though you've never met? Imagine that, but she has a microphone. After two critically acclaimed, sell-out runs, Edinburgh Comedy Award Best Show 2023 nominee Ania Magliano returns to Fringe. 'Consistently amusing and deceptively daring' **** (Times' Top 4 Best Comedy Shows 2023). ***** (Telegraph), **** (Guardian, Evening Standard, Time Out). Writer for Amelia Dimoldenberg. Ania's choices on Off Menu are widely regarded as the worst of all time.; Category: Comedy",
    "start": "Aug 9-10, 22 "
  },
  {
    "title": "Every Brilliant Thing",
    "presenter": "Paines Plough and Second Half Productions ",
    "location": "ROUNDABOUT @ Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EVERYBR_CFO_1.jpg",
    "description": "Ten years on from the play’s debut, a new production of the smash-hit comes to Roundabout, directed by Duncan Macmillan and performed by Jonny Donahoe. You’re seven years old. Mum’s in hospital. Dad says she’s ‘done something stupid'. She finds it hard to be happy. So you make a list of everything that’s brilliant about the world. Everything worth living for. Ice cream. Water fights. Staying up past your bedtime and being allowed to watch TV. The colour yellow. Rollercoasters. People falling over. A play about depression and the lengths we go to for those we love.; Category: Theatre",
    "start": ""
  },
  {
    "title": "Every Brilliant Thing",
    "presenter": "Paines Plough and Second Half Productions ",
    "location": "ROUNDABOUT @ Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EVERYBR_CFO_1.jpg",
    "description": "Ten years on from the play’s debut, a new production of the smash-hit comes to Roundabout, directed by Duncan Macmillan and performed by Jonny Donahoe. You’re seven years old. Mum’s in hospital. Dad says she’s ‘done something stupid'. She finds it hard to be happy. So you make a list of everything that’s brilliant about the world. Everything worth living for. Ice cream. Water fights. Staying up past your bedtime and being allowed to watch TV. The colour yellow. Rollercoasters. People falling over. A play about depression and the lengths we go to for those we love.; Category: Theatre",
    "start": ""
  },
  {
    "title": "Nish Kumar: Nish, Don't Kill My Vibe (Work-in-Progress) ",
    "presenter": "Plosive Live in association with PBJ Management",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NISHKUM_BRQ.jpg",
    "description": "Work-in-progress show for a new tour. In this election year – with the country in turmoil – there’s only one comedian who can kill the mood even further… Nish Kumar. One of The Guardian and The Telegraph’s 50 Best Comedians of the 21st Century is back with a brand-new politically charged stand-up show. As seen and heard on The Mash Report, Taskmaster, Pod Save the UK, Live at the Apollo, Hold the Front Page and your favourite tabloid newspaper. ‘The smartest, and often the silliest, political comic we’ve got’ **** (Guardian).; Category: Comedy",
    "start": ""
  },
  {
    "title": "Nation",
    "presenter": "YESYESNONO",
    "location": "ROUNDABOUT @ Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NATION_CFO.jpg",
    "description": "'Here we all are... sat together in one room. One room. One audience. One… beautiful nation'. From the creator of We Were Promised Honey! and Five Encounters on a Site Called Craigslist comes a new experiment in storytelling. It’s the story of a nation. It’s the story of a theatre. It’s the story of an audience. Outside there are people trying to get in. And in the middle of the room… apparently a show is taking place. ‘YESYESNONO make shows that feel completely different to anybody else’ (Exeunt). Off West End Award finalist, 2022. Best Production, Total Theatre Award.; Category: Theatre",
    "start": "Aug 8-12, 14-19, 21-26 "
  },
  {
    "title": "Nation",
    "presenter": "YESYESNONO",
    "location": "ROUNDABOUT @ Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NATION_CFO.jpg",
    "description": "'Here we all are... sat together in one room. One room. One audience. One… beautiful nation'. From the creator of We Were Promised Honey! and Five Encounters on a Site Called Craigslist comes a new experiment in storytelling. It’s the story of a nation. It’s the story of a theatre. It’s the story of an audience. Outside there are people trying to get in. And in the middle of the room… apparently a show is taking place. ‘YESYESNONO make shows that feel completely different to anybody else’ (Exeunt). Off West End Award finalist, 2022. Best Production, Total Theatre Award.; Category: Theatre",
    "start": "Aug 8-12, 14-19, 21-26 "
  },
  {
    "title": "Rebels and Patriots",
    "presenter": "Floating Shed",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024REBELSA_PH.jpg",
    "description": "Hath not a Jew eyes? Hath not an Arab eyes? Israeli-Palestinian co-creation following four friends and how mandatory conscription to the IDF affects them. One wants to get out, one's a pilot, one was never drafted, one's torn inside. A raw multilingual, physical portrayal that exposes the consequences army life has on the mental-health of the teenagers enlisted. It explores themes like protest against war, self-harm and what it means to be Israeli and peace-pursuing; the critical voice for coexistence under the pressures of politically motivated violence. Who's a rebel? Who's a patriot?; Category: Theatre",
    "start": "Aug 6, 8-13, 15-20, 22-26 "
  },
  {
    "title": "Paddy Young: If I Told You I'd Have to Kiss You",
    "presenter": "Berk's Nest in association with PARKAS Comedy",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PADDYYO_BRR.jpg",
    "description": "A second show has hit Paddy Young, and this time he's yearning. You ever been so loved up you've had to hit yourself over the head with a hammer to calm down? You can't stare at your crush but my god you can close your eyes and imagine your future together. Thousands of kisses, hundreds of cuddles and the tiniest bit of shagging - Paddy xxx. 'Young is surely on the road to stardom' ***** (Rolling Stone). **** (Independent). **** (Scotsman). **** (ThreeWeeks). **** (Chortle.co.uk). **** (Entertainment-Now.com). **** (BeyondTheJoke.co.uk).; Category: Comedy",
    "start": "Aug 6-13, 15-23 "
  },
  {
    "title": "Paddy Young: If I Told You I'd Have to Kiss You",
    "presenter": "Berk's Nest in association with PARKAS Comedy",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PADDYYO_BRR.jpg",
    "description": "A second show has hit Paddy Young, and this time he's yearning. You ever been so loved up you've had to hit yourself over the head with a hammer to calm down? You can't stare at your crush but my god you can close your eyes and imagine your future together. Thousands of kisses, hundreds of cuddles and the tiniest bit of shagging - Paddy xxx. 'Young is surely on the road to stardom' ***** (Rolling Stone). **** (Independent). **** (Scotsman). **** (ThreeWeeks). **** (Chortle.co.uk). **** (Entertainment-Now.com). **** (BeyondTheJoke.co.uk).; Category: Comedy",
    "start": "Aug 6-13, 15-23 "
  },
  {
    "title": "The Big Bite-Size Breakfast Show",
    "presenter": "Pleasance and White Room",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BIGBITE_PN.jpg",
    "description": "Good morning Edinburgh! We're back bringing you brand-new, delicious, rotating \"menus\" of 10-15 minute comedies, eccentricities and mini-dramas - all served up with complimentary tea and coffee, croissants and strawberries. The perfect way to start your day! 'One of the most important shows you'll see at the Fringe' ***** (Daily Record). ***** (FringeReview.co.uk – Brighton, Edinburgh and Adelaide). ***** (WhatsOnStage.com). Carol Tambor Award – Shortlist. Sky Arts Broadcasts. ThreeWeeks Editors' Nomination. Observer / Guardian Picks of the Fringe. Full 'menu' information available at: https://www.bite-size.org.uk/; Category: Theatre",
    "start": "Aug 7-13, 15-22, 24-26 "
  },
  {
    "title": "Luke Wright: Joy!",
    "presenter": "Luke Wright",
    "location": "Pleasance Dome",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LUKEWRI_PT.jpg",
    "description": "Novelist Henry de Montherlant said that 'happiness writes white' but Wright's not exactly starting with a blank page. The Fringe's favourite poet returns with stacks of brilliant, big-hearted poems that get to grips with joy in mulchy middle age. Come let a little joy into your life with a raconteur and wordsmith at the top of his game. ***** (Telegraph). 'Breathtaking... sharpness and wisdom that lifts the soul, and soothes the battered heart' **** (Scotsman). 'A winning combination of honesty, humour, ire and wonder. He is at the peak of his powers' ***** (Stage).; Category: Theatre",
    "start": "Aug 6-13 "
  },
  {
    "title": "Jo Caulfield Pearls Before Swine",
    "presenter": "Jo Caulfield / The Stand Comedy Club",
    "location": "The Stand Comedy Club 3 & 4",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JOCAULF_SV.jpg",
    "description": "Jo's best jokes and funniest routines from her 2024 tour show. Voted Comedian's Comedian of the Year. Relish razor-sharp observations and scandalous one-liners as Jo gets her claws into everything that annoys her. Featured on HIGNFY, House Of Games, Mock The Week, Michael McIntyre Show, John Bishop Show, Breaking The News. 'Packed with brilliant lines, embarrassing anecdotes and hilarious insights' ***** (Herald). 'Sharp-witted urban comedy that goes down a treat' ***** (Times). 'One of Britain's smartest comics' ***** (Scotsman). 'There is a reason her shows are constantly selling out, she is fantastic' ***** (ThreeWeeks).; Category: Comedy",
    "start": "Aug 7-11, 13-18, 20-25 "
  },
  {
    "title": "12th Year! John Hunt Four O'Clock Afternoon Blues and Swing",
    "presenter": "21st Century Blues Legends",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412THYEA_ZO.jpg",
    "description": "'Fantastic!' (Jools Holland). 'Boogie-woogie slide-guitar master' **** (Scotsman). 'The Fringe's most unique, inventive and soulful blues performer, a fantastic gig' **** (BroadwayBaby.com). Hunt's 12th Fringe following 11 years of full-house performances. 'Blues legend built his own cannibalised, recycled guitars from a B&Q shelf and papier-mache' **** (Herald). 'Instantly evocative of the deep south blues. Unique R'n'B take on Sinatra alongside a James Bond mash-up. Whatever Hunt plays, it feels refreshingly authentic' **** (List). 'Ingenious 21st-century blues' **** (ThreeWeeks). 'Like Seasick Steve in a science lab, a storming set' (Ian Rankin).; Category: Music",
    "start": "Aug 7, 9-10, 14, 16-18, 22, 24 "
  },
  {
    "title": "12th Year! John Hunt Four O'Clock Afternoon Blues and Swing",
    "presenter": "21st Century Blues Legends",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412THYEA_ZO.jpg",
    "description": "'Fantastic!' (Jools Holland). 'Boogie-woogie slide-guitar master' **** (Scotsman). 'The Fringe's most unique, inventive and soulful blues performer, a fantastic gig' **** (BroadwayBaby.com). Hunt's 12th Fringe following 11 years of full-house performances. 'Blues legend built his own cannibalised, recycled guitars from a B&Q shelf and papier-mache' **** (Herald). 'Instantly evocative of the deep south blues. Unique R'n'B take on Sinatra alongside a James Bond mash-up. Whatever Hunt plays, it feels refreshingly authentic' **** (List). 'Ingenious 21st-century blues' **** (ThreeWeeks). 'Like Seasick Steve in a science lab, a storming set' (Ian Rankin).; Category: Music",
    "start": "Aug 7, 9-10, 14, 16-18, 22, 24 "
  }
]