[
  {
      "event_id": 1,
      "title": "0 AD – After Dairy: A Split Bill Stand-Up Show",
      "description": "An hour of wall-to-wall laughs from two of Scotland's most exciting new comedians – Liam Jackson and Grant Barr! Liam dissects his mishaps in the job market, travels and Scottish culture from a fresh perspective with verve and hilarity. ‘Very relaxed, confident, at ease on stage. Very consistent flow with good punchlines. Also... funny!’ (The Stand Comedy Club). Grant Barr is a stand-up and farmer hailing from the Kingdom of Fife. Grant's side-splitting observations and hysterical anecdotes on farming and rural Scottish life will leave you howling.; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-25 ",
      "location": "Laughing Horse @ The Three Sisters",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20240ADAFTE_2A.jpg",
      "preference_id": 1,
      "liked": true
  },
  {
      "event_id": 2,
      "title": "0 Plans: A Crowd Work and Stand-up Comedy Show",
      "description": "A crowd-work and improvised stand-up comedy show with zero plans. Join us for an intimate night of comedy where Northern Irish comedian Reece Kidd and friends will entertain you and make you laugh. Reece has over 30 million views online and over 30,000 followers on Instagram. Zero Plans had a sold-out run of the Edinburgh Fringe in 2023 with 50+ five-star audience reviews.; Category: Comedy",
      "presenter": null,
      "date": "",
      "location": "Alchemist | St James Quarter",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20240PLANSA_CLE.jpg",
      "preference_id": 2,
      "liked": false
  },
  {
      "event_id": 3,
      "title": "0 Plans: A Crowd Work and Stand-up Comedy Show",
      "description": "A crowd-work and improvised stand-up comedy show with zero plans. Join us for an intimate night of comedy where Northern Irish comedian Reece Kidd and friends will entertain you and make you laugh. Reece has over 30 million views online and over 30,000 followers on Instagram. Zero Plans had a sold-out run of the Edinburgh Fringe in 2023 with 50+ five-star audience reviews.; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-25 ",
      "location": "Alchemist Cocktail Bar and Restaurant",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20240PLANSA_CLD.jpg",
      "preference_id": 3,
      "liked": false
  },
  {
      "event_id": 4,
      "title": "0 to 30 – Dan Boerman's Quarter Life Crisis",
      "description": "Unhinged, in the best way, and genuinely original. Live from New Zealand - Dan Boerman debuts his high-energy solo hour in Edinburgh, after packed-out New Zealand Fringe shows! Dan has turned 30, and started going to therapy. He's not there to find a solution, he just wanted to tell a stranger he doesn't plan on changing. Join Dan Boerman in his chaotic solo hour, sharing tales as a long-haired lout all the way from NZ. 'Please come' (Dan).; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-11, 13-18, 20-25 ",
      "location": "Scottish Comedy Festival @ Waverley Bar",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20240TO30DA_CFF.jpg",
      "preference_id": 4,
      "liked": true
  },
  {
      "event_id": 5,
      "title": "001 – Laughing Matters (Work in Progress)",
      "description": "I left Israel to live in Berlin, because it is ironically safer. My mother would disagree as she is a Holocaust survivor and therefore kind of needy, so I moved to the one country she would never visit me in. Come and I'll tell you all about it.; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-25 ",
      "location": "Laughing Horse @ Bar 50",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024101LAUG_BSB.jpg",
      "preference_id": 5,
      "liked": false
  },
  {
      "event_id": 6,
      "title": "007 Voices of Bond",
      "description": "Immerse yourself in the world of 007 and the legendary voices that have accompanied Bond. Goldfinger, Skyfall, Diamonds Are Forever and more brought to life by agents Ella McCready, Alex Beharrell and the Night Owl band. Night Owl Shows bring you more than just the music with a new take on the tribute genre that has won them standing ovations worldwide. This chronological trip through the music of 007 promises all the classics with fascinating facts delivered by our own onstage agents and agent M beaming on to a screen from his bunker in London. ; Category: Music",
      "presenter": null,
      "date": "Aug 7-25 ",
      "location": "theSpace @ Symposium Hall",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024007VOIC_V6.jpg",
      "preference_id": 6,
      "liked": false
  },
  {
      "event_id": 7,
      "title": "01_Algorhythm.mp3",
      "description": "Ten beatboxers, armed only with their microphones, charming personalities, and about 50p to their names, set out to transcend the greatest threat to the modern day entertainment scene – the algorithm. Prepare to see just how far the human voice can be morphed, to not only produce sensational music, but override AI itself.; Category: Music",
      "presenter": null,
      "date": "Aug 19-24 ",
      "location": "theSpace @ Niddry St",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024VOCALMA_3S.jpg",
      "preference_id": 7,
      "liked": false
  },
  {
      "event_id": 8,
      "title": "1, 2, 3. Sh*t, that's my OCD",
      "description": "In a world full of ugliness, desperation and people touching you with dirty hands, OCD became a coping mechanism. This young girl tries to hide her symptoms, for example touching things three times, but it's in her DNA and to her discomfort the world starts noticing. But, relax. It's a comedy. Fine, tragi-comedy. A monologue full of 1,2,3s, changing from verse to prose and focused on the PTSD of sexual abuse, which worsened the girl's Obsessive Compulsive Disorder and developed it to a place where she didn't feel \"normal\". Based on real stories.; Category: Theatre",
      "presenter": null,
      "date": "Aug 9-11 ",
      "location": "Just the Tonic at The Caves",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024123SHTT_JC.jpg",
      "preference_id": 8,
      "liked": false
  },
  {
      "event_id": 9,
      "title": "1.295 Reframing Autistic Success (Kitten Steps)",
      "description": "After 2023’s sell-out show, Stags returns with laughs, adventures and his more innovative 1.295-step mission for success. Add to that some neurospicy experimentation and questioning what it means to be AuDHD in a neurotypical world, Stags finds he’s reframing everything. 'Few things more charming... With nothing but a microphone and a rain sound machine, Stags brings his audience into his memories... Audience doubled up in laughter' (Margaret Hall, Playbill). 'An immensely likeable and charismatic performer' (NeurodiverseReview.com). 'Highly recommended!!' 'Very very funny' (Audience reviews).\n; Category: Comedy",
      "presenter": null,
      "date": "Aug 7-11, 13-18, 20-25 ",
      "location": "Laughing Horse @ City Cafe",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412999_BJP.jpg",
      "preference_id": 9,
      "liked": false
  },
  {
      "event_id": 10,
      "title": "#1 All-Time Best Comedy Champion: War of the Flags",
      "description": "Who are the funniest comedians? The Americans? The English... eh... probably the Scottish, but maybe it's the Arabs? Or the Asians? Canadians? No, it's your Irish cousin... or your Indian dad? Can't forget about the Jews! The time to wonder has run out! Comics from every nation, culture and background will go head-to-head and answer the age old question: who are the funniest people? Records won't lie, there will be one champion. Join us with your country's colors, paint your face, show us your nips and let's get ready to rumble!; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-9, 11-25 ",
      "location": "Laughing Horse @ Kick Ass Cowgate",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241WORLDC_CQX.jpg",
      "preference_id": 10,
      "liked": true
  },
  {
      "event_id": 11,
      "title": "1 and Only Absolute Burlesque and Cabaret",
      "description": "Delighting audiences with sell-out shows since 2017, we are back! Experience the fiery passion and irresistible allure of our home-grown hotties at a burlesque show like no other. Watch as we charm, tease and captivate you with our sultry moves and magnetic charisma. Get ready for a night of sizzling performances, seductive secrets and scintillating entertainment that will leave you wanting more. Join us for one of a kind extravaganza that celebrates the art of tease and the beauty of burlesque. Share our ethos: Every body is a burlesque body!; Category: Cabaret and Variety",
      "presenter": null,
      "date": "Aug 6-10, 12-17, 19-25 ",
      "location": "Paradise in Augustines",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241ANDONL_P1.jpg",
      "preference_id": 11,
      "liked": false
  },
  {
      "event_id": 12,
      "title": "1 Awesome Magic Show for Families with Sam Hurst",
      "description": "Samuel Hurst, UK Family Entertainer of the Year 2019 grew up watching Saturday morning TV and Magic. The only magician the world to be on both Mr Beast and Sidemen YouTube channels brings an early morning show of amazing magic, shocking dad jokes and pure joy you could only get sat in front of the TV with a bowl of cereal. This show should be in your top five list of things to see with your family. 'Takes silliness and makes it an art form' **** (BroadwayBaby.com).; Category: Cabaret and Variety",
      "presenter": null,
      "date": "Aug 14-21, 23-25 ",
      "location": "PBH's Free Fringe @ CC Blooms",
      "image_url": "https://tickets.edfringe.com/www-data/",
      "preference_id": 12,
      "liked": false
  },
  {
      "event_id": 13,
      "title": "1 Ball Show: 1 More Encore",
      "description": "When Terence Hartnett found out that his testicular cancer had spread to his lung, he got out his notebook and started writing jokes. Two years later, 1 Ball Show has been performed at New York City's Carolines on Broadway, Chicago's Lincoln Lodge and at the Edinburgh Festival Fringe for sold-out crowds. Chemo sucks and so does losing a lung, but if you can't laugh, you might as well be dead already. 'Highly recommended show!' (FringeReview.co.uk); 'Insightful, emotional and laugh-out-loud funny!' (Comedy Clubhouse).; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-11, 13-14, 16-25 ",
      "location": "Just the Tonic at The Mash House",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241BALLSH_ACJ.jpg",
      "preference_id": 13,
      "liked": false
  },
  {
      "event_id": 14,
      "title": "1 Cent Comedy: Moni Zhang's (digital) Pick of Fringe",
      "description": "Can't afford a trip to Scotland? Too cozy in your depression nest to leave the house? Or just a savvy Fringe-goer doing your homework? Moni Zhang's got you covered. Four daily acts: a buffet of comic flavours, handpicked by Moni Zhang. Some chosen for brilliance, some for weirdness, some because Moni's a sucker for guilt trips. Catch us on YouTube.; Category: Comedy",
      "presenter": null,
      "date": "Aug 30 ",
      "location": "Fringe Online",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EDFRING_CBS.jpg",
      "preference_id": 14,
      "liked": false
  },
  {
      "event_id": 15,
      "title": "1 Cent Comedy presents: 1001 Space Adventures: Breadlove and Poophead – Interactive Children Show",
      "description": "Join Breadlove and Poophead in a cosmic journey where your child isn't just an audience member – they're the hero of their own interstellar adventure! Will they save the galaxy? It's up to our young space explorers! Mixing puppets, sound effects, painting and many more in this interactive sci-fi adventure filled with fun, learning and imagination.; Category: Children's Shows",
      "presenter": null,
      "date": "Aug 6-12, 14-25 ",
      "location": "Laughing Horse @ Bar 50",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241STORY2_UB.jpg",
      "preference_id": 15,
      "liked": false
  },
  {
      "event_id": 16,
      "title": "1 Cent Comedy presents: Black Widows",
      "description": "Welcome to the dark side of laughter, where our comics don't give a damn about your comfort zone. It's where the fearless female comics come to play, and by play we mean mercilessly toy with every dark corner of comedy there is. Expect an evening soaked in pitch-black humour, where insults are the highest form of flattery and the comedy is so twisted, it feels sinfully right. Edinburgh Fringe 2023 sell-out show! Daily rotating line-up of badass comediennes, hosted by Moni Zhang.; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-25 ",
      "location": "Laughing Horse @ City Cafe",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024666BLAC_BKH.jpg",
      "preference_id": 16,
      "liked": false
  },
  {
      "event_id": 17,
      "title": "1 Cent Comedy presents: Depression vs. Anxiety (Game Show)",
      "description": "Think your emotional baggage is heavy? Wait 'til you see ours! Join us for a night where anxiety and depression duke it out, comedy style. It's like therapy, but cheaper and with a donation at the end. Get ready to laugh at all the wrong things for all the right reasons. Who will win? Who cares! Edinburgh Fringe 2022 sell-out show. Host by Moni Zhang with a daily rotating line-up.; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-26 ",
      "location": "Scottish Comedy Festival @ Waverley Bar",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412DEPRE_CFF.jpg",
      "preference_id": 17,
      "liked": false
  },
  {
      "event_id": 18,
      "title": "1 Cent Comedy presents: Mental Health Matters at Edinburgh Fringe",
      "description": "Edinburgh Fringe 2024 is where we turn mental health discussions inside out!  Get real, get raw and definitely get ready to laugh with us. Dive into the chaos and clarity of mental health, all while exploring Edinburgh city's vibrant atmosphere. Hosted by Moni Zhang.; Category: Comedy",
      "presenter": null,
      "date": "Aug 30 ",
      "location": "Fringe Online",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MENTALH_CBS.jpg",
      "preference_id": 18,
      "liked": true
  },
  {
      "event_id": 19,
      "title": "1 Cent Comedy presents: Moni Zhang: Asian Daddy, Dead",
      "description": "Warning: Dark comedy zone! Enter at your own risk! Emerging from the ashes of her father's death, Moni Zhang brings you a dark and hilarious comedy show that will leave you gasping for air. With twisted and taboo humour, she makes light of her traumatic past, mental-health struggles and her relationship with her dead daddy. Edinburgh Festival Fringe 2023 sell-out show.\n; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-12, 14-25 ",
      "location": "Laughing Horse @ The Counting House",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241990MON_6R.jpg",
      "preference_id": 19,
      "liked": false
  },
  {
      "event_id": 20,
      "title": "1 Cent Comedy presents: Normal Dysfunctional Family (Game Show)",
      "description": "A comedy game show where comedians battle each other using childhood trauma and the audience decide who had the worst parents. Sold-out run Edinburgh Fringe 2023. Three rounds. Round One: a five-minute stand-up set about family and childhood. Round Two: prepared scenarios containing a location and a subject, and our comedians have to improvise a family fight scene based on the notes. Round Three: similar to the game Scenes We'd Like to See from Mock the Week, but only with family topics.; Category: Comedy",
      "presenter": null,
      "date": "Aug 6-25 ",
      "location": "Laughing Horse @ The Raging Bull",
      "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241001NOR_ANU.jpg",
      "preference_id": 20,
      "liked": false
  }
]